# UUDerivative Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FaceSecondDerivatives..::..UUDerivative Property
FaceSecondDerivatives Class See Also
---
The second derivative with respect to U.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ UUDerivative { get; }
```

Visual Basic
---
```text
Public ReadOnly Property UUDerivative As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ UUDerivative {
	XYZ^ get ();
}
```

# See Also
FaceSecondDerivatives Class
Autodesk.Revit.DB Namespace